# Dataframe

### Tạo Dataframe

In [17]:
students_1 <- data.frame("name" = c('Hellen', 'Jolie','Kiwi','John','Mark','Tom'),
                         'age' = c(17,16,17,18,19,16),
                         "mark" = c(9,9,8,7.5,7.5,8),
                         stringsAsFactors =FALSE
                        )

In [4]:
name <- c('Hellen', 'Jolie','Kiwi','John','Mark','Tom')
age <- c(17,16,17,18,19,16)
mark <-c(9,9,8,7.5,7.5,8)
students  <- data.frame(name,age,mark,stringsAsFactors = FALSE)

### Xem cấu trúc Dataframe

In [5]:
str(students)

'data.frame':	6 obs. of  3 variables:
 $ name: chr  "Hellen" "Jolie" "Kiwi" "John" ...
 $ age : num  17 16 17 18 19 16
 $ mark: num  9 9 8 7.5 7.5 8

In [6]:
print(summary(students))

     name                age             mark
 Length:6           Min.   :16.00   Min.   :7.500
 Class :character   1st Qu.:16.25   1st Qu.:7.625
 Mode  :character   Median :17.00   Median :8.000
                    Mean   :17.17   Mean   :8.167
                    3rd Qu.:17.75   3rd Qu.:8.750
                    Max.   :19.00   Max.   :9.000

### Trích xuất dữ liệu từ dataframe

In [7]:
print(students$mark)

[1] 9.0 9.0 8.0 7.5 7.5 8.0

In [8]:
print(students[1:2],)

    name age
1 Hellen  17
2  Jolie  16
3   Kiwi  17
4   John  18
5   Mark  19
6    Tom  16

In [9]:
print(data.frame(students$age))

  students.age
1           17
2           16
3           17
4           18
5           19
6           16

In [11]:
print(students[c(3,5), c(1,2)])

  name age
3 Kiwi  17
5 Mark  19

### Mở rộng data frame

In [14]:
students$class <- c('k256_S7N','k256_S7N','k256_S24','k256_S7N','k256_S24','k256_S7N')

In [15]:
students

  name   age mark class
1 Hellen 17  9.0  k256_S7N
2 Jolie  16  9.0  k256_S7N
3 Kiwi   17  8.0  k256_S24
4 John   18  7.5  k256_S7N
5 Mark   19  7.5  k256_S24
6 Tom    16  8.0  k256_S7N

In [18]:
students_1

  name   age mark
1 Hellen 17  9.0
2 Jolie  16  9.0
3 Kiwi   17  8.0
4 John   18  7.5
5 Mark   19  7.5
6 Tom    16  8.0

In [19]:
df_POB <- data.frame("POB" = c('UK','US','EU','UK','US','EU'))
students <- cbind(students,df_POB)

In [20]:
students

  name   age mark class    POB
1 Hellen 17  9.0  k256_S7N UK
2 Jolie  16  9.0  k256_S7N US
3 Kiwi   17  8.0  k256_S24 EU
4 John   18  7.5  k256_S7N UK
5 Mark   19  7.5  k256_S24 US
6 Tom    16  8.0  k256_S7N EU

In [22]:
new_students = data.frame("name" = c('Sunny','Lucy'),
                         'age' = c(17,18),
                         "mark" = c(8,9),
                          "class" = c('k256_S7N','k256_S24'),
                          'POB' = c('EU','UK'),           
                         stringsAsFactors =FALSE)

In [26]:
print(new_students)

   name age mark    class POB
1 Sunny  17    8 k256_S7N  EU
2  Lucy  18    9 k256_S24  UK

In [24]:
students = rbind(students,new_students)

In [25]:
students

  name   age mark class    POB
1 Hellen 17  9.0  k256_S7N UK
2 Jolie  16  9.0  k256_S7N US
3 Kiwi   17  8.0  k256_S24 EU
4 John   18  7.5  k256_S7N UK
5 Mark   19  7.5  k256_S24 US
6 Tom    16  8.0  k256_S7N EU
7 Sunny  17  8.0  k256_S7N EU
8 Lucy   18  9.0  k256_S24 UK

### Thay đổi tên cột

In [27]:
names(students)[names(students) == 'POB'] = 'Place_of_bith'

In [28]:
head(students)

  name   age mark class    Place_of_bith
1 Hellen 17  9.0  k256_S7N UK
2 Jolie  16  9.0  k256_S7N US
3 Kiwi   17  8.0  k256_S24 EU
4 John   18  7.5  k256_S7N UK
5 Mark   19  7.5  k256_S24 US
6 Tom    16  8.0  k256_S7N EU

# Tidyverse

In [30]:
library(tidyverse)

── Attaching core tidyverse packages ──────────────────────────────────────────────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.2     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.2     ✔ tibble    3.2.1
✔ lubridate 1.9.2     ✔ tidyr     1.3.0
✔ purrr     1.0.1
── Conflicts ────────────────────────────────────────────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

In [31]:
pokemon = read.csv('pokemon.csv')

In [32]:
head(pokemon)

  X. Name                  Type.1 Type.2 Total HP Attack Defense Sp..Atk
1 1  Bulbasaur             Grass  Poison 318   45  49     49      65
2 2  Ivysaur               Grass  Poison 405   60  62     63      80
3 3  Venusaur              Grass  Poison 525   80  82     83     100
4 3  VenusaurMega Venusaur Grass  Poison 625   80 100    123     122
5 4  Charmander            Fire          309   39  52     43      60
6 5  Charmeleon            Fire          405   58  64     58      80
  Sp..Def Speed Generation Legendary
1  65     45    1          False
2  80     60    1          False
3 100     80    1          False
4 120     80    1          False
5  50     65    1          False
6  65     80    1          False

In [33]:
pokemon_sub = select(pokemon, c(2,5,7,8))

In [34]:
head(pokemon_sub)

  Name                  Total Attack Defense
1 Bulbasaur             318    49     49
2 Ivysaur               405    62     63
3 Venusaur              525    82     83
4 VenusaurMega Venusaur 625   100    123
5 Charmander            309    52     43
6 Charmeleon            405    64     58

In [35]:
pokemon_sub = pokemon %>% select(Name,Total,Attack,Defense)

In [36]:
head(pokemon_sub)

  Name                  Total Attack Defense
1 Bulbasaur             318    49     49
2 Ivysaur               405    62     63
3 Venusaur              525    82     83
4 VenusaurMega Venusaur 625   100    123
5 Charmander            309    52     43
6 Charmeleon            405    64     58

### select_if

In [38]:
pokemon_numbers = select_if(pokemon, is.numeric)

In [39]:
head(pokemon_numbers)

  X. Total HP Attack Defense Sp..Atk Sp..Def Speed Generation
1 1  318   45  49     49      65      65     45    1
2 2  405   60  62     63      80      80     60    1
3 3  525   80  82     83     100     100     80    1
4 3  625   80 100    123     122     120     80    1
5 4  309   39  52     43      60      50     65    1
6 5  405   58  64     58      80      65     80    1

### Filter

In [41]:
pokemon_500_600 = filter(pokemon_sub, Total >= 500, Total <= 600)
head(pokemon_500_600)

  Name                Total Attack Defense
1 Venusaur            525    82     83
2 Charizard           534    84     78
3 Blastoise           530    83    100
4 PidgeotMega Pidgeot 579    80     80
5 Nidoqueen           505    92     87
6 Nidoking            505   102     77

### Mutate() - Tạo cột mới

In [42]:
pokemon_sub = mutate(pokemon_sub, Compare = ifelse(Attack > Defense, 1 ,0))

In [43]:
head(pokemon_sub)

  Name                  Total Attack Defense Compare
1 Bulbasaur             318    49     49     0
2 Ivysaur               405    62     63     0
3 Venusaur              525    82     83     0
4 VenusaurMega Venusaur 625   100    123     0
5 Charmander            309    52     43     1
6 Charmeleon            405    64     58     1

### Arrange() - sắp xếp

In [45]:
head(arrange(pokemon_sub, Total))

  Name      Total Attack Defense Compare
1 Sunkern   180   30     30      0
2 Azurill   190   20     40      0
3 Kricketot 194   25     41      0
4 Caterpie  195   30     35      0
5 Weedle    195   35     30      1
6 Wurmple   195   45     35      1

In [46]:
head(arrange(pokemon_sub, desc(Total)))

  Name                  Total Attack Defense Compare
1 MewtwoMega Mewtwo X   780   190    100     1
2 MewtwoMega Mewtwo Y   780   150     70     1
3 RayquazaMega Rayquaza 780   180    100     1
4 KyogrePrimal Kyogre   770   150     90     1
5 GroudonPrimal Groudon 770   180    160     1
6 Arceus                720   120    120     0

In [47]:
head(arrange(pokemon_sub, desc(Total), desc(Attack)))

  Name                  Total Attack Defense Compare
1 MewtwoMega Mewtwo X   780   190    100     1
2 RayquazaMega Rayquaza 780   180    100     1
3 MewtwoMega Mewtwo Y   780   150     70     1
4 GroudonPrimal Groudon 770   180    160     1
5 KyogrePrimal Kyogre   770   150     90     1
6 Arceus                720   120    120     0

In [48]:
group = group_by(pokemon, Type.1)
group_summay = summarize(group,
                         count = n(),
                         mean.Attack = mean(Attack, na.rm =T),
                         median.Attack = median(Attack, na.rm =T),
                         mean.Defense = mean(Defense, na.rm =T),
                         median.Defense = median(Defense, na.rm =T)
                         )

In [49]:
group_summay

   Type.1   count mean.Attack median.Attack mean.Defense median.Defense
1  Bug       69    70.97101    65.0          70.72464     60.0
2  Dark      31    88.38710    88.0          70.22581     70.0
3  Dragon    32   112.12500   113.5          86.37500     90.0
4  Electric  44    69.09091    65.0          66.29545     65.0
5  Fairy     17    61.52941    52.0          65.70588     66.0
6  Fighting  27    96.77778   100.0          65.92593     70.0
7  Fire      52    84.76923    84.5          67.76923     64.0
8  Flying     4    78.75000    85.0          66.25000     75.0
9  Ghost     32    73.78125    66.0          81.18750     72.5
10 Grass     70    73.21429    70.0          70.80000     66.0
11 Ground    32    95.75000    85.0          84.84375     84.5
12 Ice       24    72.75000    67.0          71.41667     75.0
13 Normal    98    73.46939    70.5          59.84694     60.0
14 Poison    28    74.67857    74.0          68.82143     67.0
15 Psychic   57    71.45614    57.0          67.68421     65.0
16 Rock      44    92.86364    95.0         100.79545    100.0
17 Steel     27    92.70370    89.0         126.37037    120.0
18 Water    112    74.15179    72.0          72.94643     70.0